// Задача_№82 C клавиатуры вводится строка разделенная точкой. Подсчитать количество символов до точки

string s="Jojopa."; // string? s=Console.ReadLine();
int countBefore = s.IndexOf('.');
System.Console.WriteLine(countBefore);

// string s = "qwerty.qwey";
// int countBefore = s.IndexOf('.');
// int countAfter = s.Length - countBefore - 1;
// System.Console.WriteLine(countAfter);
// System.Console.WriteLine(countBefore);


